In [15]:
import pandas as pd

In [16]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [17]:
#4, 8, 15, 16, 23, and 42.
# 1. 
df = pd.Series([4,8,15,23,42])
print(df)

0     4
1     8
2    15
3    23
4    42
dtype: int64

In [18]:
#2 .Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

list = [1,2,3,4,5,6,7,8,9,10]
pd.Series(list)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [20]:
#3 .
df1 = pd.DataFrame({ 'Name' : ['alice' , 'bob ', 'Claire'],
                     'age'  : [ 25 , 30 ,27 ] ,
                     'gender' : ['female' ,' male' ,'female']
                   }
    )

In [21]:
df1.head()

     Name  age  gender
0   alice   25  female
1    bob    30    male
2  Claire   27  female

4 . A dataframe in pandas is a 2-dimension structure matrix which can hold a quntitatives as well as qualitative data .
    it has a row and coloumn structure . each coloumn is of type series . the dataframe are used for build some conclusion 
    through a data .

A series is a basic data structure . it stores data in linear fashion .

In [22]:
# example of dataframe and series 
df2 = pd.DataFrame({ 'Name' : ['vinay' , 'akash', 'Tanishq'],
                     'age'  : [ 21 , 21 ,21 ] ,
                     'gender' : ['male' ,' male' ,'male'] , 
                    'field of interest' : ['Data science' , 'meran stack ' , 'codeforces contest ']
                   }
    )

In [23]:
df2.head()

      Name  age gender    field of interest
0    vinay   21   male         Data science
1    akash   21   male         meran stack
2  Tanishq   21   male  codeforces contest

In [24]:
series = pd.Series([1,2,3,4,6,5])

In [25]:
series

0    1
1    2
2    3
3    4
4    6
5    5
dtype: int64

5. we can use some function like - describe , columns , dtypes , iloc , loc , groupby , merge , dropna , fillna , some condition under dataframes

In [31]:
# example 
df2[df2['age'] > 20]

      Name  age gender    field of interest
0    vinay   21   male         Data science
1    akash   21   male         meran stack
2  Tanishq   21   male  codeforces contest

In [30]:
df2[df2['Name'] == 'vinay']

    Name  age gender field of interest
0  vinay   21   male      Data science

6 . In Pandas, a Series , Dataframe , panel  is mutable, meaning you can change the values in a Series , dataframe , panel after it has been created.     You can modify individual elements in a Series by assigning new values to them.
    In pandas dataframe are most popular , then Series , panel are least used .

In [34]:
#7 .
list1 = [1,2,3,4,5]
Id = pd.Series(list1)

list2 = ['a' , 'b' , 'c' , 'd' ,'e']
Name = pd.Series(list2)

list3 = ['red' , 'blue' , 'green' , 'yellow' , 'orange']
color = pd.Series(list3)

df3 = pd.DataFrame({'Id' : Id ,
                    'Name' : Name , 
                    'color' : color
                   })
df3.head()

   Id Name   color
0   1    a     red
1   2    b    blue
2   3    c   green
3   4    d  yellow
4   5    e  orange